// api/demo.js

var detail={
    'code':'1',
    'message':'请求成功',
    'lists':[
        {
            imgSrc:'http://www.ttpcn.com/uploads/2018/0925/6cdd477bfe1d4d9bdcb653160f40a5cd.jpg',
            imgId: '1',
            title:'【绝色山峰】意大利多洛米蒂斯洛文尼亚山区深度摄影之旅',
            desc:'最美山峰：它被20世纪最有名的建筑师勒·柯布西耶称为“世界上最美的建筑杰作”。这里山峦壮丽，奇峰林立，姿态独特而迷人，大山怀抱着许多魅力无穷的村庄。这里空气纯净，风景如画，随处可见美妙绝伦的山景、垂直的岩壁、陡峭的悬崖和星罗棋布、幽深狭长的山谷。这里就是意大利北部著名的多洛米蒂山，又名“白石山”，来自于洁白无瑕的白云石。每至破晓和日落时分，山中万物都会染上一层粉红色，接着渐变为暗红色——这种现象被称为阿尔卑斯之光，多洛米蒂因此而闻名于世。诗意山村：斯洛文尼亚境内森林、海滨、湖泊、高山、溶洞，各种地形',
            date:'2019.6.26-2019.7.7',
            time:'12',
            phone:'028-83351137',
            price:'56800元/人'
        },
        {
            imgSrc:'http://www.ttpcn.com/uploads/2019/0115/37db094106c351b528908d779ec27db5.jpg',
            imgId: '2',
            title:'【绝色山峰】意大利多洛米蒂斯洛文尼亚山区深度摄影之旅',
            desc:'最美山峰：它被20世纪最有名的建筑师勒·柯布西耶称为“世界上最美的建筑杰作”。这里山峦壮丽，奇峰林立，姿态独特而迷人，大山怀抱着许多魅力无穷的村庄。这里空气纯净，风景如画，随处可见美妙绝伦的山景、垂直的岩壁、陡峭的悬崖和星罗棋布、幽深狭长的山谷。这里就是意大利北部著名的多洛米蒂山，又名“白石山”，来自于洁白无瑕的白云石。每至破晓和日落时分，山中万物都会染上一层粉红色，接着渐变为暗红色——这种现象被称为阿尔卑斯之光，多洛米蒂因此而闻名于世。诗意山村：斯洛文尼亚境内森林、海滨、湖泊、高山、溶洞，各种地形',
            date:'2019.6.26-2019.7.7',
            time:'12',
            phone:'028-83351137',
            price:'56800元/人'
        },
        {
            imgSrc:'http://www.ttpcn.com/uploads/2019/0301/b168f91812e1e391deb5fbeba5449246.jpg',
            imgId: '3',
            title:'【绝色山峰】意大利多洛米蒂斯洛文尼亚山区深度摄影之旅',
            desc:'最美山峰：它被20世纪最有名的建筑师勒·柯布西耶称为“世界上最美的建筑杰作”。这里山峦壮丽，奇峰林立，姿态独特而迷人，大山怀抱着许多魅力无穷的村庄。这里空气纯净，风景如画，随处可见美妙绝伦的山景、垂直的岩壁、陡峭的悬崖和星罗棋布、幽深狭长的山谷。这里就是意大利北部著名的多洛米蒂山，又名“白石山”，来自于洁白无瑕的白云石。每至破晓和日落时分，山中万物都会染上一层粉红色，接着渐变为暗红色——这种现象被称为阿尔卑斯之光，多洛米蒂因此而闻名于世。诗意山村：斯洛文尼亚境内森林、海滨、湖泊、高山、溶洞，各种地形',
            date:'2019.6.26-2019.7.7',
            time:'12',
            phone:'028-83351137',
            price:'56800元/人'
        },
        {
            imgSrc:'http://www.ttpcn.com/uploads/2019/0517/e567e628d751ff5a25e8de4635d3daaa.jpg',
            imgId: '4',
            title:'【绝色山峰】意大利多洛米蒂斯洛文尼亚山区深度摄影之旅',
            desc:'最美山峰：它被20世纪最有名的建筑师勒·柯布西耶称为“世界上最美的建筑杰作”。这里山峦壮丽，奇峰林立，姿态独特而迷人，大山怀抱着许多魅力无穷的村庄。这里空气纯净，风景如画，随处可见美妙绝伦的山景、垂直的岩壁、陡峭的悬崖和星罗棋布、幽深狭长的山谷。这里就是意大利北部著名的多洛米蒂山，又名“白石山”，来自于洁白无瑕的白云石。每至破晓和日落时分，山中万物都会染上一层粉红色，接着渐变为暗红色——这种现象被称为阿尔卑斯之光，多洛米蒂因此而闻名于世。诗意山村：斯洛文尼亚境内森林、海滨、湖泊、高山、溶洞，各种地形',
            date:'2019.6.26-2019.7.7',
            time:'12',
            phone:'028-83351137',
            price:'56800元/人'
        },
        {
            imgSrc:'http://www.ttpcn.com/uploads/2019/0425/6ce2d2448be72ed4a237f9f3242ea4b7.png',
            imgId: '5',
            title:'【绝色山峰】意大利多洛米蒂斯洛文尼亚山区深度摄影之旅',
            desc:'最美山峰：它被20世纪最有名的建筑师勒·柯布西耶称为“世界上最美的建筑杰作”。这里山峦壮丽，奇峰林立，姿态独特而迷人，大山怀抱着许多魅力无穷的村庄。这里空气纯净，风景如画，随处可见美妙绝伦的山景、垂直的岩壁、陡峭的悬崖和星罗棋布、幽深狭长的山谷。这里就是意大利北部著名的多洛米蒂山，又名“白石山”，来自于洁白无瑕的白云石。每至破晓和日落时分，山中万物都会染上一层粉红色，接着渐变为暗红色——这种现象被称为阿尔卑斯之光，多洛米蒂因此而闻名于世。诗意山村：斯洛文尼亚境内森林、海滨、湖泊、高山、溶洞，各种地形',
            date:'2019.6.26-2019.7.7',
            time:'12',
            phone:'028-83351137',
            price:'56800元/人'
        },
    ]
}
exports.getData = function(method,data){
    console.log(data)
    var backData={
        "code":'1',
        "msg":"请求成功",
        "data":detail.lists[data.id]
    }
    
    return JSON.stringify(backData);
};
