// api/demo.js

var detail={
    'code':'1',
    'message':'请求成功',
    'lists':[
        {
            imgSrc:'http://www.ttpcn.com/uploads/2019/0301/b168f91812e1e391deb5fbeba5449246.jpg',
            imgId: '1',
            title:'【极地仙境】',
            desc:'最美山峰：它被20世纪最有名的建筑师勒·柯布西耶称为“世界上最美的建筑杰作”。这里山峦壮丽，奇峰林立，姿态独特而迷人，大山怀抱着许多魅力无穷的村庄。这里空气纯净，风景如画，随处可见美妙绝伦的山景、垂直的岩壁、陡峭的悬崖和星罗棋布、幽深狭长的山谷。这里就是意大利北部著名的多洛米蒂山，又名“白石山”，来自于洁白无瑕的白云石。每至破晓和日落时分，山中万物都会染上一层粉红色，接着渐变为暗红色——这种现象被称为阿尔卑斯之光，多洛米蒂因此而闻名于世。诗意山村：斯洛文尼亚境内森林、海滨、湖泊、高山、溶洞，各种地形',
            date:'2019.6.26-2019.7.7',
            time:'12',
            phone:'028-83351137',
            price:'46800元/人'
        },
        {
            imgSrc:'http://www.ttpcn.com/uploads/2019/0517/e567e628d751ff5a25e8de4635d3daaa.jpg',
            imgId: '2',
            title:'【绝色山峰】',
            desc:'最美山峰：它被20世纪最有名的建筑师勒·柯布西耶称为“世界上最美的建筑杰作”。这里山峦壮丽，奇峰林立，姿态独特而迷人，大山怀抱着许多魅力无穷的村庄。这里空气纯净，风景如画，随处可见美妙绝伦的山景、垂直的岩壁、陡峭的悬崖和星罗棋布、幽深狭长的山谷。这里就是意大利北部著名的多洛米蒂山，又名“白石山”，来自于洁白无瑕的白云石。每至破晓和日落时分，山中万物都会染上一层粉红色，接着渐变为暗红色——这种现象被称为阿尔卑斯之光，多洛米蒂因此而闻名于世。诗意山村：斯洛文尼亚境内森林、海滨、湖泊、高山、溶洞，各种地形',
            date:'2019.6.26-2019.7.7',
            time:'16',
            phone:'028-83351137',
            price:'66800元/人'
        },
        {
            imgSrc:'http://www.ttpcn.com/uploads/2019/0515/c75dcda3d18b466af025ca3e6a63ab24.jpg',
            imgId: '3',
            title:'【极地仙境】',
            desc:'最美山峰：它被20世纪最有名的建筑师勒·柯布西耶称为“世界上最美的建筑杰作”。这里山峦壮丽，奇峰林立，姿态独特而迷人，大山怀抱着许多魅力无穷的村庄。这里空气纯净，风景如画，随处可见美妙绝伦的山景、垂直的岩壁、陡峭的悬崖和星罗棋布、幽深狭长的山谷。这里就是意大利北部著名的多洛米蒂山，又名“白石山”，来自于洁白无瑕的白云石。每至破晓和日落时分，山中万物都会染上一层粉红色，接着渐变为暗红色——这种现象被称为阿尔卑斯之光，多洛米蒂因此而闻名于世。诗意山村：斯洛文尼亚境内森林、海滨、湖泊、高山、溶洞，各种地形',
            date:'2019.6.26-2019.7.7',
            time:'15',
            phone:'028-83351137',
            price:'86800元/人'
        },
        {
            imgSrc:'http://www.ttpcn.com/uploads/2019/0222/ce6e8e8cea16772ddb7cdd0c767e94ee.jpg',
            imgId: '4',
            title:'【生存之路】',
            desc:'最美山峰：它被20世纪最有名的建筑师勒·柯布西耶称为“世界上最美的建筑杰作”。这里山峦壮丽，奇峰林立，姿态独特而迷人，大山怀抱着许多魅力无穷的村庄。这里空气纯净，风景如画，随处可见美妙绝伦的山景、垂直的岩壁、陡峭的悬崖和星罗棋布、幽深狭长的山谷。这里就是意大利北部著名的多洛米蒂山，又名“白石山”，来自于洁白无瑕的白云石。每至破晓和日落时分，山中万物都会染上一层粉红色，接着渐变为暗红色——这种现象被称为阿尔卑斯之光，多洛米蒂因此而闻名于世。诗意山村：斯洛文尼亚境内森林、海滨、湖泊、高山、溶洞，各种地形',
            date:'2019.6.26-2019.7.7',
            time:'18',
            phone:'028-83351137',
            price:'66800元/人'
        },
        {
            imgSrc:'http://www.ttpcn.com/uploads/2019/0315/9b6a36717763734d09c844bf0492e84e.jpg',
            imgId: '5',
            title:'【邂逅帝企鹅】',
            desc:'最美山峰：它被20世纪最有名的建筑师勒·柯布西耶称为“世界上最美的建筑杰作”。这里山峦壮丽，奇峰林立，姿态独特而迷人，大山怀抱着许多魅力无穷的村庄。这里空气纯净，风景如画，随处可见美妙绝伦的山景、垂直的岩壁、陡峭的悬崖和星罗棋布、幽深狭长的山谷。这里就是意大利北部著名的多洛米蒂山，又名“白石山”，来自于洁白无瑕的白云石。每至破晓和日落时分，山中万物都会染上一层粉红色，接着渐变为暗红色——这种现象被称为阿尔卑斯之光，多洛米蒂因此而闻名于世。诗意山村：斯洛文尼亚境内森林、海滨、湖泊、高山、溶洞，各种地形',
            date:'2019.6.26-2019.7.7',
            time:'12',
            phone:'028-83351137',
            price:'86800元/人'
        },
        {
            imgSrc:'http://www.ttpcn.com/uploads/2019/0116/501426446dc94797a96946adadc15349.jpg',
            imgId: '6',
            title:'【花开中土】',
            desc:'最美山峰：它被20世纪最有名的建筑师勒·柯布西耶称为“世界上最美的建筑杰作”。这里山峦壮丽，奇峰林立，姿态独特而迷人，大山怀抱着许多魅力无穷的村庄。这里空气纯净，风景如画，随处可见美妙绝伦的山景、垂直的岩壁、陡峭的悬崖和星罗棋布、幽深狭长的山谷。这里就是意大利北部著名的多洛米蒂山，又名“白石山”，来自于洁白无瑕的白云石。每至破晓和日落时分，山中万物都会染上一层粉红色，接着渐变为暗红色——这种现象被称为阿尔卑斯之光，多洛米蒂因此而闻名于世。诗意山村：斯洛文尼亚境内森林、海滨、湖泊、高山、溶洞，各种地形',
            date:'2019.6.26-2019.7.7',
            time:'14',
            phone:'028-83351137',
            price:'36800元/人'
        },
        {
            imgSrc:'http://www.ttpcn.com/uploads/2019/0116/418f038752edf27a4d552a59c80e45f6.jpg',
            imgId: '7',
            title:'【花开中土】',
            desc:'最美山峰：它被20世纪最有名的建筑师勒·柯布西耶称为“世界上最美的建筑杰作”。这里山峦壮丽，奇峰林立，姿态独特而迷人，大山怀抱着许多魅力无穷的村庄。这里空气纯净，风景如画，随处可见美妙绝伦的山景、垂直的岩壁、陡峭的悬崖和星罗棋布、幽深狭长的山谷。这里就是意大利北部著名的多洛米蒂山，又名“白石山”，来自于洁白无瑕的白云石。每至破晓和日落时分，山中万物都会染上一层粉红色，接着渐变为暗红色——这种现象被称为阿尔卑斯之光，多洛米蒂因此而闻名于世。诗意山村：斯洛文尼亚境内森林、海滨、湖泊、高山、溶洞，各种地形',
            date:'2019.6.26-2019.7.7',
            time:'15',
            phone:'028-83351137',
            price:'46800元/人'
        },
        {
            imgSrc:'http://www.ttpcn.com/uploads/2019/0301/a150d6307036359501846c07c51c9dcf.jpg',
            imgId: '8',
            title:'【母子温情】',
            desc:'最美山峰：它被20世纪最有名的建筑师勒·柯布西耶称为“世界上最美的建筑杰作”。这里山峦壮丽，奇峰林立，姿态独特而迷人，大山怀抱着许多魅力无穷的村庄。这里空气纯净，风景如画，随处可见美妙绝伦的山景、垂直的岩壁、陡峭的悬崖和星罗棋布、幽深狭长的山谷。这里就是意大利北部著名的多洛米蒂山，又名“白石山”，来自于洁白无瑕的白云石。每至破晓和日落时分，山中万物都会染上一层粉红色，接着渐变为暗红色——这种现象被称为阿尔卑斯之光，多洛米蒂因此而闻名于世。诗意山村：斯洛文尼亚境内森林、海滨、湖泊、高山、溶洞，各种地形',
            date:'2019.6.26-2019.7.7',
            time:'16',
            phone:'028-83351137',
            price:'56800元/人'
        },
        {
            imgSrc:'http://www.ttpcn.com/uploads/2019/0505/5d5370fc5a51bfc88330e29bd73a074b.jpg',
            imgId: '9',
            title:'【寻找北极熊】',
            desc:'最美山峰：它被20世纪最有名的建筑师勒·柯布西耶称为“世界上最美的建筑杰作”。这里山峦壮丽，奇峰林立，姿态独特而迷人，大山怀抱着许多魅力无穷的村庄。这里空气纯净，风景如画，随处可见美妙绝伦的山景、垂直的岩壁、陡峭的悬崖和星罗棋布、幽深狭长的山谷。这里就是意大利北部著名的多洛米蒂山，又名“白石山”，来自于洁白无瑕的白云石。每至破晓和日落时分，山中万物都会染上一层粉红色，接着渐变为暗红色——这种现象被称为阿尔卑斯之光，多洛米蒂因此而闻名于世。诗意山村：斯洛文尼亚境内森林、海滨、湖泊、高山、溶洞，各种地形',
            date:'2019.6.26-2019.7.7',
            time:'12',
            phone:'028-83351137',
            price:'46800元/人'
        },
    ]
}
exports.getData = function(method,data){
    console.log(data)
    var backData={
        "code":'1',
        "msg":"请求成功",
        "data":detail
    }
    
    return JSON.stringify(backData);
};
